;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! wttrin :recipe (:host github :repo "bcbcarl/emacs-wttrin"))
(package! doom-themes)
(package! py-autopep8)
(package! elpy)
(package! org-bullets)
(package! org-super-agenda)
(package! moe-theme)
(package! all-the-icons)
(package! powerline)
(package! hc-zenburn-theme)
(package! avy)
