;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! avy)
(package! company-lsp)
(package! all-the-icons)
(package! all-the-icons-ivy)
(package! all-the-icons-ivy-rich)
(package! emmet-mode)
(package! flymake-jslint)
(package! go)
(package! helm-css-scss)
(package! helm-emmet)
(package! helm-go-package)
(package! js2-mode)
(package! js2-refactor)
(package! minesweeper)
(package! moe-theme)
(package! powerline)
(package! py-autopep8)
(package! treemacs-icons-dired)
(package! treemacs-projectile)
(package! tide)
(package! add-node-modules-path)
(package! yaml-mode)
(package! wttrin :recipe (:host github :repo "bcbcarl/emacs-wttrin"))
(package! keychain-environment)
(package! rinari)
(package! rvm)
(package! exec-path-from-shell)
(package! tern)
(package! hc-zenburn-theme)
(package! zenburn-theme)
(package! sublime-themes)
(package! sunburn-theme)
(package! kaolin-themes)
(package! graphql-mode)
(package! polymode)
(package! poly-ruby)
(package! poly-markdown)
